-- Add categories of offers
INSERT INTO categories (label, picture, retina_picture) VALUES
('Дом', 'cat.jpg', 'cat@2x.jpg'),
('Электроника', 'cat02.jpg', 'cat02@2x.jpg'),
('Одежда', 'cat03.jpg', 'cat03@2x.jpg'),
('Спорт/отдых', 'cat04.jpg', 'cat04@2x.jpg'),
('Авто', 'cat05.jpg', 'cat05@2x.jpg'),
('Книги', 'cat06.jpg', 'cat06@2x.jpg');

-- Add app users
INSERT INTO users (first_name, last_name, email, picture, retina_picture) VALUES
('Иван', 'Иванов', 'ivan.ivanov@yandex.ru', 'avatar01.jpg', 'avatar01@2x.jpg'),
('Георгий', 'Шпиц', 'george.spitz@yandex.ru', 'avatar02.jpg', 'avatar02@2x.jpg'),
('Александр', 'Бурый', 'alexander.buriy@yandex.ru', 'avatar03.jpg', 'avatar03@2x.jpg'),
('Анатолий', 'Хакимов', 'anatoly.khakimov@yandex.ru', 'avatar04.jpg', 'avatar04@2x.jpg');

-- Add offers types
INSERT INTO types (label) VALUES
('Куплю'),
('Продам');

-- Add offers
INSERT INTO offers (title, description, type_id, sum, user_id, picture, retina_picture, created_at, updated_at) VALUES
('Куплю цветок','Цветок зелёный в горшке.',1,3000,1,'item01.jpg','item01@2x.jpg','2020-12-20','2020-12-20'),
('Куплю кресло','Серое кресло для офиса.',1,12000,1,'item02.jpg','item02@2x.jpg','2020-12-20','2020-12-20'),
('Продам карманные часы','Карманные часы на цепочке.',2,5000,1,'item03.jpg','item03@2x.jpg','2020-12-20','2020-12-20'),
('Продам кофеварку','Кофеварка металлическая.',2,4000,1,'item04.jpg','item04@2x.jpg','2020-12-20','2020-12-20'),
('Продам Land Rover','Land Rover белый, в хорошем состоянии.',2,1300000,1,'item05.jpg','item05@2x.jpg','2020-12-20','2020-12-20'),
('Куплю драм машину','Драм машина для студии.',1,73000,1,'item06.jpg','item06@2x.jpg','2020-12-20','2020-12-20'),
('Куплю сноуборд','Сноуборд с оранжевыми оттенками.',1,34000,1,'item07.jpg','item07@2x.jpg','2020-12-20','2020-12-20'),
('Куплю фотоаппарат','Фотоаппарат Canon 800D.',1,50000,1,'item08.jpg','item08@2x.jpg','2020-12-20','2020-12-20'),
('Продам чайник','Чайник металлический.',2,5000,2,'item09.jpg','item09@2x.jpg','2020-12-20','2020-12-20'),
('Продам светильник','Светильник настольный.',2,3000,2,'item10.jpg','item10@2x.jpg','2020-12-20','2020-12-20'),
('Продам зеркало','Зеркало с вырезной рамкой.',2,2000,2,'item11.jpg','item11@2x.jpg','2020-12-20','2020-12-20'),
('Продам магнитофон','Кассетный магнитофон с радиоприёмником.',2,1000,2,'item12.jpg','item12@2x.jpg','2020-12-20','2020-12-20'),
('Куплю штатив','Небольшой штатив для камер и фотоаппаратов.',1,23000,2,'item13.jpg','item13@2x.jpg','2020-12-20','2020-12-20'),
('Куплю дрон','Дрон с камерой.',1,15000,2,'item14.jpg','item14@2x.jpg','2020-12-20','2020-12-20'),
('Куплю кофеварку','Стационарная кофеварка на 2-3 литра.',1,10000,2,'item15.jpg','item15@2x.jpg','2020-12-20','2020-12-20'),
('Продам автомобиль','Легковой автомобиль.',2,230000,2,'item16.jpg','item16@2x.jpg','2020-12-20','2020-12-20');

-- Add comments for offers
INSERT INTO comments (offer_id, user_id, text, created_at) VALUES
(1, 1, 'Неплохо, но дорого', '2020-01-01'),
(1, 2, 'Совсем немного...', '2020-01-02'),
(1, 3, 'Оплата наличными или перевод на карту?', '2020-01-03'),
(1, 4, 'Вы что?! В магазине дешевле.', '2020-01-04'),
(1, 1, 'С чем связана продажа? Почему так дешёво?', '2020-01-05'),
(1, 2, 'А где блок питания?', '2020-01-06'),
(2, 3, 'А сколько игр в комплекте?', '2020-01-07'),
(2, 4, 'Вы что?! В магазине дешевле.', '2020-01-08'),
(2, 1, 'Почему в таком ужасном состоянии?', '2020-01-09'),
(2, 2, 'Неплохо, но дорого', '2020-01-10'),
(3, 3, 'Оплата наличными или перевод на карту?', '2020-01-11'),
(3, 4, 'А сколько игр в комплекте?', '2020-01-12'),
(3, 1, 'Продаю в связи с переездом. Отрываю от сердца.', '2020-01-13'),
(3, 2, 'Почему в таком ужасном состоянии?', '2020-01-14'),
(4, 3, 'Вы что?! В магазине дешевле.', '2020-01-15'),
(4, 4, 'С чем связана продажа? Почему так дешёво?', '2020-01-16'),
(4, 1, 'Почему в таком ужасном состоянии?', '2020-01-17'),
(4, 2, 'Неплохо, но дорого', '2020-01-18'),
(4, 3, 'А сколько игр в комплекте?', '2020-01-19'),
(4, 4, 'А где блок питания?', '2020-01-20'),
(5, 1, 'А где блок питания?', '2020-01-21'),
(5, 2, 'Неплохо, но дорого', '2020-01-22');

-- Add relations between offers and categories
INSERT INTO offer_categories (offer_id, category_id) VALUES 
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 5),
(6, 1),
(7, 4),
(8, 2),
(9, 1),
(10, 2),
(11, 1),
(12, 2),
(13, 1),
(14, 2),
(15, 1),
(16, 5);